In [5]:
import pandas as pd

In [6]:
# load dataset
sales_df = pd.read_csv("sample_data1 - Sheet1 (1).csv")

In [7]:
# Basic overview
sales_df.info()
sales_df.head()

<class 'pandas.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Employee_ID         15 non-null     int64
 1   Department          15 non-null     str
 2   Region              15 non-null     str
 3   Salary              15 non-null     int64
 4   Experience_Years    15 non-null     int64
 5   Performance_Rating  14 non-null     float64
 6   Monthly_Sales       14 non-null     float64
dtypes: float64(2), int64(3), str(2)
memory usage: 972.0 bytes

,Employee_ID,Department,Region,Salary,Experience_Years,Performance_Rating,Monthly_Sales
0,1001,Sales,North,45000,2,4.0,120000.0
1,1002,Marketing,South,52000,3,3.0,98000.0
2,1003,Sales,East,47000,4,5.0,150000.0
3,1004,HR,West,40000,1,3.0,0.0
4,1005,IT,North,60000,5,4.0,0.0

In [8]:
# Missing values check
sales_df.isna().sum()

Employee_ID           0
Department            0
Region                0
Salary                0
Experience_Years      0
Performance_Rating    1
Monthly_Sales         1
dtype: int64

In [9]:
# Remove rows with missing Sales
sales_clean = sales_df.dropna(subset=['Monthly_Sales'])

In [10]:
# Total sales by Region
sales_clean.groupby('Region')['Monthly_Sales'].sum().sort_values(ascending=False)

Region
East     377000.0
South    363000.0
North    245000.0
West      92000.0
Name: Monthly_Sales, dtype: float64

In [11]:
# Average sales by Region
sales_clean.groupby('Region')['Monthly_Sales'].mean()

Region
East     94250.000000
North    81666.666667
South    90750.000000
West     30666.666667
Name: Monthly_Sales, dtype: float64

In [12]:
# Transaction count per Region
sales_clean['Region'].value_counts()

Region
South    4
East     4
North    3
West     3
Name: count, dtype: int64